---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeEditFailedError
source: html/bbebe17c-106c-8524-e7de-0a9723c4a8f2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeEditFailedError Property

Slab Shape Edit failed. [Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId SlabShapeEditFailedError { get; }
```